app/controllers/api/v1/members_controller.rb

SELECT "members".* FROM "members"
---
  def index
    members = Member.all()

INSERT INTO "members" ("name", "lastname", "email") VALUES (?, ?, ?)  [["name", "luca"], ["lastname", "bucchi"], ["email", "luca@bucchi.it"]]
---
  def create
    member = Member.new(member_params)

    if member.save

UPDATE "members" SET "name" = ? WHERE "members"."id" = ?  [["name", "Lallo"], ["id", 3]]
---
  def update
    if @member.update(member_params)

DELETE FROM "members" WHERE "members"."id" = ?  [["id", 4]]
---
  def destroy
    if @member.destroy